{
  "nodes": [
    {
      "op": "null", 
      "name": "data0", 
      "attrs": {"__profiler_scope__": "<unk>:"}, 
      "inputs": []
    }, 
    {
      "op": "repeat", 
      "name": "qnetworkattention1_repeat0", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "axis": "3", 
        "repeats": "3"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "repeat", 
      "name": "qnetworkattention1_repeat1", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "axis": "4", 
        "repeats": "3"
      }, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "qnetworkattention1_reshape0", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "shape": "(-3, -2)"
      }, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(6, 3, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(6,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv6_fwd", 
      "attrs": {
        "__profiler_scope__": "conv6:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "6", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv6_softrelu_fwd", 
      "attrs": {
        "__profiler_scope__": "conv6:softrelu:", 
        "act_type": "softrelu"
      }, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv7_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(6, 6, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv7_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(6,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv7_fwd", 
      "attrs": {
        "__profiler_scope__": "conv7:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "6", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "conv7_softrelu_fwd", 
      "attrs": {
        "__profiler_scope__": "conv7:softrelu:", 
        "act_type": "softrelu"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv8_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(6, 6, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv8_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(6,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv8_fwd", 
      "attrs": {
        "__profiler_scope__": "conv8:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "6", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[7, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "qnetworkattention1_transpose0", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "axes": "(0, 2, 3, 1)"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "qnetworkattention1_reshape1", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "shape": "(0, -3, -1)"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "layernorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(6,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "layernorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(6,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "layernorm2_layernorm0", 
      "attrs": {
        "__profiler_scope__": "layernorm2:", 
        "axis": "-1", 
        "eps": "1e-05"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data1", 
      "attrs": {"__profiler_scope__": "<unk>:"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embedding3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(5, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "embedding3_fwd", 
      "attrs": {
        "__profiler_scope__": "embedding3:", 
        "dtype": "float32", 
        "input_dim": "5", 
        "output_dim": "768", 
        "sparse_grad": "False"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "qnetworkattention1_reshape2", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "shape": "(-3, 128, -1)"
      }, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "layernorm3_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(6,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "layernorm3_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(6,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "layernorm3_layernorm0", 
      "attrs": {
        "__profiler_scope__": "layernorm3:", 
        "axis": "-1", 
        "eps": "1e-05"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "_linalg_gemm2", 
      "name": "qnetworkattention1_linalg_gemm20", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "alpha": "0.08838834764831843", 
        "transpose_b": "True"
      }, 
      "inputs": [[19, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv10_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(6, 6, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv10_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(6,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv10_fwd", 
      "attrs": {
        "__profiler_scope__": "conv10:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "6", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[7, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "qnetworkattention1_transpose1", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "axes": "(0, 2, 3, 1)"
      }, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "qnetworkattention1_reshape3", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "shape": "(0, -3, -1)"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "LayerNorm", 
      "name": "layernorm2_layernorm0", 
      "attrs": {
        "__profiler_scope__": "layernorm2:", 
        "axis": "-1", 
        "eps": "1e-05"
      }, 
      "inputs": [[32, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data2", 
      "attrs": {"__profiler_scope__": "<unk>:"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embedding5_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(10, 60)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "embedding5_fwd", 
      "attrs": {
        "__profiler_scope__": "embedding5:", 
        "dtype": "float32", 
        "input_dim": "10", 
        "output_dim": "60", 
        "sparse_grad": "False"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "qnetworkattention1_reshape4", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "shape": "(-3, 10, -1)"
      }, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "LayerNorm", 
      "name": "layernorm3_layernorm0", 
      "attrs": {
        "__profiler_scope__": "layernorm3:", 
        "axis": "-1", 
        "eps": "1e-05"
      }, 
      "inputs": [[37, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "_linalg_gemm2", 
      "name": "qnetworkattention1_linalg_gemm21", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "alpha": "0.31622776601683794", 
        "transpose_b": "True"
      }, 
      "inputs": [[33, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv9_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(6, 6, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv9_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(6,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv9_fwd", 
      "attrs": {
        "__profiler_scope__": "conv9:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "6", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[7, 0, 0], [40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "qnetworkattention1_transpose2", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "axes": "(0, 2, 3, 1)"
      }, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "qnetworkattention1_reshape5", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "shape": "(0, -3, -1)"
      }, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "LayerNorm", 
      "name": "layernorm2_layernorm0", 
      "attrs": {
        "__profiler_scope__": "layernorm2:", 
        "axis": "-1", 
        "eps": "1e-05"
      }, 
      "inputs": [[44, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data3", 
      "attrs": {"__profiler_scope__": "<unk>:"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embedding4_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(100, 60)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "embedding4_fwd", 
      "attrs": {
        "__profiler_scope__": "embedding4:", 
        "dtype": "float32", 
        "input_dim": "100", 
        "output_dim": "60", 
        "sparse_grad": "False"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "qnetworkattention1_reshape6", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "shape": "(-3, 10, -1)"
      }, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "LayerNorm", 
      "name": "layernorm3_layernorm0", 
      "attrs": {
        "__profiler_scope__": "layernorm3:", 
        "axis": "-1", 
        "eps": "1e-05"
      }, 
      "inputs": [[49, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "_linalg_gemm2", 
      "name": "qnetworkattention1_linalg_gemm22", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "alpha": "0.31622776601683794", 
        "transpose_b": "True"
      }, 
      "inputs": [[45, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "qnetworkattention1_concat0", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "dim": "2", 
        "num_args": "3"
      }, 
      "inputs": [[27, 0, 0], [39, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "reshape_like", 
      "name": "qnetworkattention1_reshape_like0", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "lhs_begin": "1", 
        "lhs_end": "2", 
        "rhs_begin": "1", 
        "rhs_end": "3"
      }, 
      "inputs": [[52, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "qnetworkattention1_transpose3", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "axes": "(0, 3, 1, 2)"
      }, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "qnetworkattention1_concat1", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[11, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv11_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(6, 154, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv11_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(6,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv11_fwd", 
      "attrs": {
        "__profiler_scope__": "conv11:", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "6", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[55, 0, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "qnetworkattention1_reshape7", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "shape": "(0, -1)"
      }, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "reshape_like", 
      "name": "qnetworkattention1_reshape_like1", 
      "attrs": {
        "__profiler_scope__": "qnetworkattention1:", 
        "lhs_begin": "0", 
        "lhs_end": "1", 
        "rhs_begin": "0", 
        "rhs_end": "2"
      }, 
      "inputs": [[59, 0, 0], [0, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "gru1_swapaxes0", 
      "attrs": {
        "__profiler_scope__": "gru1:", 
        "dim1": "0", 
        "dim2": "1"
      }, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gru1_l0_i2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(600, 150)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "gru1_reshape0", 
      "attrs": {
        "__profiler_scope__": "gru1:", 
        "shape": "-1"
      }, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gru1_l0_h2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(600, 200)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "gru1_reshape1", 
      "attrs": {
        "__profiler_scope__": "gru1:", 
        "shape": "-1"
      }, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gru1_l0_i2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(600,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "gru1_reshape2", 
      "attrs": {
        "__profiler_scope__": "gru1:", 
        "shape": "-1"
      }, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gru1_l0_h2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(600,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "gru1_reshape3", 
      "attrs": {
        "__profiler_scope__": "gru1:", 
        "shape": "-1"
      }, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "_rnn_param_concat", 
      "name": "gru1__rnn_param_concat0", 
      "attrs": {
        "__profiler_scope__": "gru1:", 
        "dim": "0", 
        "num_args": "4"
      }, 
      "inputs": [[63, 0, 0], [65, 0, 0], [67, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "qnetworkattention1_gru1_h0_0", 
      "attrs": {
        "__layout__": "LNC", 
        "__profiler_scope__": "qnetworkattention1:", 
        "dtype": "float32", 
        "shape": "(1, 0, 200)"
      }, 
      "inputs": []
    }, 
    {
      "op": "RNN", 
      "name": "gru1_rnn0", 
      "attrs": {
        "__profiler_scope__": "gru1:", 
        "bidirectional": "False", 
        "lstm_state_clip_max": "None", 
        "lstm_state_clip_min": "None", 
        "lstm_state_clip_nan": "False", 
        "mode": "gru", 
        "num_layers": "1", 
        "p": "0", 
        "projection_size": "None", 
        "state_outputs": "True", 
        "state_size": "200", 
        "use_sequence_length": "False"
      }, 
      "inputs": [[61, 0, 0], [70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "gru1_swapaxes1", 
      "attrs": {
        "__profiler_scope__": "gru1:", 
        "dim1": "0", 
        "dim2": "1"
      }, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(4, 400)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "qnetworkattention1:", 
        "__shape__": "(4,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "dense1_fwd", 
      "attrs": {
        "__profiler_scope__": "dense1:", 
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "4"
      }, 
      "inputs": [[73, 0, 0], [74, 0, 0], [75, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    4, 
    5, 
    8, 
    9, 
    12, 
    13, 
    17, 
    18, 
    20, 
    21, 
    24, 
    25, 
    28, 
    29, 
    34, 
    35, 
    40, 
    41, 
    46, 
    47, 
    56, 
    57, 
    62, 
    64, 
    66, 
    68, 
    74, 
    75
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    40, 
    41, 
    42, 
    43, 
    44, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    56, 
    57, 
    58, 
    59, 
    60, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    86, 
    87, 
    88, 
    89, 
    90
  ], 
  "heads": [[76, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 20000]}
}